[
  {
    "text": "The soul of the sluggard craves and gets nothing, while the soul of the diligent is richly supplied.",
    "reference": "Proverbs 13:4"
  },
  {
    "text": "The plans of the diligent lead surely to abundance, but everyone who is hasty comes only to poverty.",
    "reference": "Proverbs 21:5"
  },
  {
    "text": "The hand of the diligent will rule, while the slothful will be put to forced labor.",
    "reference": "Proverbs 12:24"
  },
  {
    "text": "A slack hand causes poverty, but the hand of the diligent makes rich.",
    "reference": "Proverbs 10:4"
  },
  {
    "text": "Go to the ant, O sluggard; consider her ways, and be wise.",
    "reference": "Proverbs 6:6"
  },
  {
    "text": "Whatever your hand finds to do, do it with your might, for there is no work or thought or knowledge or wisdom in Sheol, to which you are going.",
    "reference": "Ecclesiastes 9:10"
  },
  {
    "text": "Let us not become weary in doing good, for at the proper time we will reap a harvest if we do not give up.",
    "reference": "Galatians 6:9"
  },
  {
    "text": "Do your best to present yourself to God as one approved, a worker who has no need to be ashamed, rightly handling the word of truth.",
    "reference": "2 Timothy 2:15"
  },
  {
    "text": "We want each of you to show this same diligence to the very end, so that what you hope for may be fully realized.",
    "reference": "Hebrews 6:11"
  },
  {
    "text": "Therefore, brothers, be all the more diligent to confirm your calling and election, for if you practice these qualities you will never fall.",
    "reference": "2 Peter 1:10"
  },
  {
    "text": "You shall diligently keep the commandments of the Lord your God, and his testimonies and his statutes, which he has commanded you.",
    "reference": "Deuteronomy 6:17"
  },
  {
    "text": "Keep your heart with all vigilance, for from it flow the springs of life.",
    "reference": "Proverbs 4:23"
  },
  {
    "text": "I press on toward the goal for the prize of the upward call of God in Christ Jesus.",
    "reference": "Philippians 3:14"
  },
  {
    "text": "Whoever works his land will have plenty of bread, but he who follows worthless pursuits lacks sense.",
    "reference": "Proverbs 12:11"
  },
  {
    "text": "The diligent man will get precious wealth.",
    "reference": "Proverbs 12:27"
  },
  {
    "text": "Be diligent to know the state of your flocks, and attend to your herds.",
    "reference": "Proverbs 27:23"
  },
  {
    "text": "We must work the works of him who sent me while it is day; night is coming, when no one can work.",
    "reference": "John 9:4"
  },
  {
    "text": "I love those who love me, and those who seek me diligently find me.",
    "reference": "Proverbs 8:17"
  },
  {
    "text": "You have commanded your precepts to be kept diligently.",
    "reference": "Psalm 119:4"
  },
  {
    "text": "If you will diligently listen to the voice of the Lord your God, and do that which is right in his eyes, and give ear to his commandments and keep all his statutes, I will put none of the diseases on you that I put on the Egyptians, for I am the Lord, your healer.",
    "reference": "Exodus 15:26"
  },
  {
    "text": "Only take care, and keep your soul diligently, lest you forget the things that your eyes have seen, and lest they depart from your heart all the days of your life.",
    "reference": "Deuteronomy 4:9"
  },
  {
    "text": "And we desire each one of you to show the same earnestness to have the full assurance of hope until the end.",
    "reference": "Hebrews 6:11"
  },
  {
    "text": "Whoever diligently seeks good seeks favor, but evil comes to him who searches for it.",
    "reference": "Proverbs 11:27"
  },
  {
    "text": "Therefore, beloved, since you are waiting for these, be diligent to be found by him without spot or blemish, and at peace.",
    "reference": "2 Peter 3:14"
  },
  {
    "text": "And with them we are sending our brother whom we have often tested and found earnest in many matters, but who is now more earnest than ever because of his great confidence in you.",
    "reference": "2 Corinthians 8:22"
  },
  {
    "text": "So we built the wall. And all the wall was joined together to half its height, for the people had a mind to work.",
    "reference": "Nehemiah 4:6"
  },
  {
    "text": "He who gathers in summer is a prudent son, but he who sleeps in harvest is a son who brings shame.",
    "reference": "Proverbs 10:5"
  },
  {
    "text": "The thoughts of the diligent tend only to plenteousness; but every one that is hasty hasteth only to want.",
    "reference": "Proverbs 21:5"
  },
  {
    "text": "And let our people learn to devote themselves to good works, so as to help cases of urgent need, and not be unfruitful.",
    "reference": "Titus 3:14"
  },
  {
    "text": "Be not slothful in zeal, be fervent in spirit, serve the Lord.",
    "reference": "Romans 12:11"
  }
]
